Revit 2027 API
TableView.TargetId Property
 the element id of the element that is being viewed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TargetId { get; set; }
Public Property TargetId As ElementId
	Get
	Set
public:
property ElementId^ TargetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TargetId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace